import React from 'react';
// import {usePublicData} from "publicData";
import ContactUs from "@/components/AboutAndContactUs/ContactUs";
import TitleAndDescription from "@/components/TitleAndDescription";

const AboutUs = ({data = {}}) => {
    // const publicData = usePublicData();
    const textAboutUs = `به AdobeArts خوش آمدید، مرکز تخصصی شما برای تمام نیازهای طراحی و گرافیک. با بیش از 3 سال تجربه، ما
                    در AdobeArts به ارائه خدمات ابتکاری و خلاق در زمینه‌های طراحی وب‌سایت، موشن گرافیک، طراحی بنر، ساخت
                    کارت ویزیت، و طراحی پوستر متعهد هستیم. ما مفتخریم که به مشتریان خود کمک می‌کنیم تا با استفاده از
                    طراحی‌های نوآورانه و جذاب، برند خود را در بازار پررقابت امروز متمایز سازند.

                    تخصص ما، خلق ایده‌های برتر است. تیم متخصص ما از طراحان و توسعه‌دهندگان، با بهره‌گیری از آخرین
                    فناوری‌ها و رویکردهای مدرن، پروژه‌هایی را به سرانجام می‌رساند که نه تنها ظاهری شیک و مدرن دارند،
                    بلکه عملکردی فوق‌العاده نیز ارائه می‌دهند. از وب‌سایت‌های واکنش‌گرا گرفته تا انیمیشن‌های موشن
                    گرافیکی که داستان برند شما را به تصویر می‌کشند، ما به هر جزئیاتی توجه می‌کنیم تا اطمینان حاصل شود که
                    نتیجه نهایی فراتر از انتظارات شما است.

                    رضایت مشتریان، اولویت ماست. ما در AdobeArts، به ایجاد روابط مستحکم و طولانی‌مدت با مشتریان خود
                    افتخار می‌کنیم و با ارائه پشتیبانی و خدمات پس از فروش، در کنار شما خواهیم بود تا اطمینان حاصل کنیم
                    که تجربه‌ی شما با ما همیشه بی‌نقص باشد.

                    به ما اعتماد کنید تا برند شما را به اوج برسانیم. اگر به دنبال راه‌حل‌های خلاقانه در زمینه طراحی
                    گرافیک یا توسعه وب هستید، AdobeArts آماده است تا پروژه شما را به یک تجربه موفق تبدیل کند. برای
                    شروع یک همکاری هیجان‌انگیز، همین امروز با ما تماس بگیرید.`

    return (
        <div className={"container"} style={{margin: "1.5rem 0"}}>
            <TitleAndDescription
                title={"درباره ما"}
                text={textAboutUs}
            />

            <ContactUs/>
        </div>
    );
};

export default AboutUs;